; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	infrared3 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star6 - direction
	Star7 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star7)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star8)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(have_image Planet9 infrared3)
	(have_image Star10 infrared3)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared3)
))

)

; plan
1. (turn_to satellite3 star8 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star8)
   goals met: 0 of 5
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 5
3. (calibrate satellite3 instrument6 star8)
   added: (calibrated instrument6)
   goals met: 0 of 5
4. (turn_to satellite3 planet11 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 planet11)
   goals met: 0 of 5
5. (take_image satellite3 planet11 instrument6 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 1 of 5
6. (turn_to satellite3 phenomenon12 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 5
7. (take_image satellite3 phenomenon12 instrument6 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 2 of 5
8. (turn_to satellite3 planet13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet13)
   goals met: 2 of 5
9. (take_image satellite3 planet13 instrument6 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 3 of 5
10. (turn_to satellite3 planet9 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet9)
   goals met: 3 of 5
11. (take_image satellite3 planet9 instrument6 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 4 of 5
12. (turn_to satellite3 star10 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star10)
   goals met: 4 of 5
13. (take_image satellite3 star10 instrument6 infrared3)
   added: (have_image star10 infrared3)
   goals met: 5 of 5
